---
kind: method
id: M:Autodesk.Revit.DB.Plumbing.PipingSystem.IsPressureDropServerMissing
source: html/15b75922-cc13-8780-63a3-c024b89e6121.htm
---
# Autodesk.Revit.DB.Plumbing.PipingSystem.IsPressureDropServerMissing Method

Indicates if any pressure drop server which was used in the piping system is not available.

## Syntax (C#)
```csharp
public bool IsPressureDropServerMissing()
```

## Returns
True if there is any pressure drop server not available, false otherwise.